package defence.app;

import org.junit.jupiter.api.Test;
import org.springframework.boot.test.context.SpringBootTest;

@SpringBootTest
class KidVenturesApplicationTests {

	//Интеграционните тестове са вид тестване, които се фокусират върху проверката на взаимодействието между
	// различни компоненти или системи в приложението.
	// Тези тестове се използват за уверяване, че различните части на софтуерното приложение работят заедно
	// коректно.
//покриват функционалности, които изискват взаимодействие между различни компоненти или системи, което обикновено не
// може да бъде напълно изпробвано с юнит тестове.
//
//Поведение на системата като цяло: Интеграционните тестове имат за цел да проверят дали системата като
// цяло работи правилно, след като компонентите са интегрирани.
	@Test
	void contextLoads() {
	}

}
